# ExportBaseQuantities Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..ExportBaseQuantities Property
ExporterIFC Class See Also
---
Identifies if the export should include IFC standard quantities currently supported by Revit.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ExportBaseQuantities { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExportBaseQuantities As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ExportBaseQuantities {
	bool get ();
}
```

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace